Repository: onesmalldog/TUIKit_iOS
Catalog: live/Resources/Localized/TUILiveKitLocalized.xcstrings
Source language: en
Languages: ar, ja, zh_hans, zh_hant

# app_cancel
source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# app_tips_title
source: Warm Tips
ar: نصائح مفيدة
ja: 親切なヒント
zh_hans: 温馨提示
zh_hant: 溫馨提示

# app_toast_login_fail
source: Login failed
ar: فشل تسجيل الدخول
ja: ログインに失敗しました
zh_hans: 登录失败
zh_hant: 登錄失敗

# app_toast_login_success
source: Logged In
ar: تم تسجيل الدخول
ja: 正常にログインします
zh_hans: 登录成功
zh_hant: 登錄成功

# common_disconnect_guest_tips
source: Are you sure you want to disconnect xxx?
ar: هل أنت متأكد أنك تريد قطع الاتصال بـ xxx؟
ja: xxxの接続を切断したいですか？
zh_hans: 确定要断开xxx的连麦吗？
zh_hant: 確定要斷開xxx的連麥嗎？

# common_anchor_battle
source: Battle
ar: المنافسة
ja: アンカーPK
zh_hans: 主播PK
zh_hant: 主播PK

# common_anchor_end_link_tips
source: You are currently co-guesting with other streamers. Would you like to [End Live] ?
ar: أنت حالياً في بث مشترك مع مذيعين آخرين. هل تريد [إنهاء البث]؟
ja: 現在、接続されている州では、「ライブブロードキャストルームを閉じる」必要がありますか？
zh_hans: 当前处于连麦状态，是否需要「关闭直播间」
zh_hant: 當前處於連麥狀態，是否需要「關閉直播間」

# common_battle_connecting
source: Connecting
ar: جاري الاتصال
ja: 接続
zh_hans: 连线中
zh_hant: 連線中

# common_battle_end_pk
source: End PK
ar: إنهاء المنافسة
ja: PKを終了します
zh_hans: 结束PK
zh_hant: 結束PK

# common_battle_end_pk_tips
source: Are you sure you want to end the battle? The current result will be the final result after the end
ar: هل أنت متأكد أنك تريد إنهاء المنافسة؟ النتيجة الحالية ستكون النتيجة النهائية
ja: PKを終了したいですか？終了後、現在の結果が最終結果になります
zh_hans: 确定要结束PK吗？结束后将以当前结果为最终结果
zh_hant: 確定要結束PK嗎？結束後將以當前結果為最終結果

# common_battle_invitation_timeout
source: Battle request has been timeout
ar: انتهت مهلة طلب المنافسة
ja: PKの招待状がタイムアウトしました
zh_hans: PK邀请已超时
zh_hant: PK邀請已超時

# common_battle_invitee_reject
source: xxx rejected battle
ar: xxx رفض المنافسة
ja: xxxPKを拒否しました
zh_hans: xxx拒绝了 PK
zh_hant: xxx拒絕了 PK

# common_request_rejected
source: xxx rejected
ar: xxx رفض
ja: xxx张绝了邀请
zh_hans: xxx拒绝了邀请
zh_hant: xxx拒絕了邀請

# common_battle_inviter_cancel
source: xxx canceled battle, please try to initiate it again
ar: xxx ألغى المنافسة، يرجى المحاولة مرة أخرى
ja: xxx PKはキャンセルされました。もう一度開始してみてください
zh_hans: xxx取消了PK，请尝试再次发起
zh_hant: xxx 取消了 PK，請嘗試再次發起

# common_battle_inviting
source: xxx invite you to battle together
ar: xxx يدعوك للمنافسة معاً
ja: xxxPK招待状を送信します
zh_hans: xxx向你发来PK邀请
zh_hant: xxx向你發來PK邀請

# common_battle_pk_end
source: PK End
ar: انتهت المنافسة
ja: PKは終了します
zh_hans: PK结束
zh_hant: PK結束

# common_battle_wait_stop
source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# common_connect_conflict
source: The room you are invited to connect to is connected to another room.
ar: الغرفة المدعو للاتصال بها متصلة بغرفة أخرى.
ja: 接続に招待された部屋は、他の部屋に接続されています。
zh_hans: 被邀请连线的房间与其他房间连线中。
zh_hant: 被邀請連線的房間與其他房間連線中。

# common_connect_error
source: Other errors, cannot connect.
ar: أخطاء أخرى، لا يمكن الاتصال.
ja: 接続を開始できない他のエラー
zh_hans: 其他错误，无法发起连线
zh_hant: 其他錯誤，無法發起連線

# common_connect_inviting
source: Waiting
ar: في الانتظار
ja: 招待
zh_hans: 邀请中
zh_hant: 邀請中

# common_connect_inviting_append
source: xxx invite you to host together
ar: xxx يدعوك للبث المشترك
ja: xxx接続への招待状を送ってください
zh_hans: xxx向你发来连线邀请
zh_hant: xxx向你發來連線邀請

# common_connect_invitation_timeout
source: Invitation has timed out
ar: انتهت مهلة الدعوة
ja: 招待がタイムアウトしました
zh_hans: 邀请已超时
zh_hant: 邀請已超時

# common_connection
source: Start Co-hosting
ar: بدء البث المشترك
ja: 接続を開始します
zh_hans: 发起连线
zh_hant: 發起連線

# common_connection_room_full
source: The number of co-hosting has exceeded the maximum limit.
ar: تجاوز عدد البث المشترك الحد الأقصى.
ja: 接続されている人の現在の数は、最大制限に達しました。
zh_hans: 当前连线人数已达最大限制。
zh_hant: 當前連線人數已達最大限制。

# common_cover
source: Cover
ar: الغلاف
ja: カバー
zh_hans: 封面
zh_hant: 封面

# common_dashboard_audio_info_title
source: Audio Information
ar: معلومات الصوت
ja: オーディオ情報
zh_hans: 音频信息
zh_hant: 音頻信息

# common_dashboard_audio_sample_rate
source: Sample Rate
ar: معدل العينات
ja: サンプリングレート
zh_hans: 采样率
zh_hant: 採樣率

# common_dashboard_down_loss
source: DownLoss
ar: فقدان التنزيل
ja: ダウンリンクパケット損失率
zh_hans: 下行丢包率
zh_hant: 下行丟包率

# common_dashboard_local_user
source: Local User
ar: المستخدم المحلي
ja: ローカルユーザー
zh_hans: 本地用户
zh_hant: 本地用戶

# common_dashboard_remote_user
source: Remote User
ar: المستخدم البعيد
ja: リモートユーザー
zh_hans: 远端用户
zh_hant: 遠端用戶

# common_dashboard_rtt
source: RTT
ar: زمن الذهاب والإياب
ja: 往復遅延
zh_hans: 往返延时
zh_hant: 往返延時

# common_dashboard_title
source: Dashboard
ar: لوحة المعلومات
ja: ダッシュボード
zh_hans: 仪表盘
zh_hant: 儀錶盤

# common_dashboard_up_loss
source: UpLoss
ar: فقدان الرفع
ja: アップリンクパケット損失率
zh_hans: 上行丢包率
zh_hant: 上行丟包率

# common_dashboard_bitrate
source: Bitrate
ar: معدل البت
ja: コードレート
zh_hans: 码率
zh_hant: 碼率

# common_dashboard_video_fps
source: FPS
ar: معدل الإطارات
ja: フレームレート
zh_hans: 帧率
zh_hant: 幀率

# common_dashboard_video_info_title
source: Video Information
ar: معلومات الفيديو
ja: ビデオ情報
zh_hans: 视频信息
zh_hant: 視頻信息

# common_dashboard_video_resolution
source: Resolution
ar: الدقة
ja: 解決
zh_hans: 分辨率
zh_hant: 解析度

# common_disable_audio
source: Disable Audio
ar: تعطيل الصوت
ja: オーディオを無効にします
zh_hans: 禁用音频
zh_hant: 禁用音頻

# common_disable_message
source: Disable Chat
ar: تعطيل الدردشة
ja: チャット禁止
zh_hans: 禁止发言
zh_hant: 禁止發言

# common_disable_video
source: Disable Video
ar: تعطيل الفيديو
ja: ビデオを無効にします
zh_hans: 禁用视频
zh_hant: 禁用視頻

# common_disconnect_cancel
source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# common_disconnect_tips
source: Are you sure you want to disconnect from other streamers?
ar: هل أنت متأكد أنك تريد قطع الاتصال بالمذيعين الآخرين؟
ja: 他のアンカーから切断したいですか？
zh_hans: 确定要断开与其他主播的连线吗?
zh_hant: 確定要斷開與其他主播的連線嗎?

# common_disconnection
source: Disconnect
ar: قطع الاتصال
ja: 切断します
zh_hans: 断开
zh_hant: 斷開

# common_enable_audience_request_link
source: Allow viewers to apply for continuous microphone
ar: السماح للمشاهدين بالتقدم للميكروفون المستمر
ja: 視聴者が接続を申請できるようにします
zh_hans: 允许观众申请连麦
zh_hant: 允許觀眾申請連麥

# common_enable_audio
source: Enable Audio
ar: تفعيل الصوت
ja: オーディオを有効にします
zh_hans: 启用音频
zh_hant: 啟用音頻

# common_enable_message
source: Enable Chat
ar: تفعيل الدردشة
ja: 禁止を解放します
zh_hans: 解除禁言
zh_hant: 解除禁言

# common_enable_video
source: Enable Video
ar: تفعيل الفيديو
ja: ビデオを有効にします
zh_hans: 启用视频
zh_hant: 啟用視頻

# common_end_connect
source: Disconnect
ar: قطع الاتصال
ja: 切断された
zh_hans: 断开连线
zh_hant: 斷開連線

# common_end_connection
source: End Co-host
ar: إنهاء البث المشترك
ja: 切断された
zh_hans: 断开连线
zh_hant: 斷開連線

# common_end_connection_tips
source: You are currently co-hosting with other streamers. Would you like to [End Co-host] or [End Live] ?
ar: أنت حالياً في بث مشترك. هل تريد [إنهاء البث المشترك] أم [إنهاء البث]؟
ja: 現在、接続されている州では、「ライブブロードキャストルームを閉じる」または「閉じる」必要がありますか？
zh_hans: 当前处于连线状态，是否需要「断开连线」或「关闭直播间」
zh_hant: 當前處於連線狀態，是否需要「斷開連線」或「關閉直播間」

# common_end_pk
source: End PK
ar: إنهاء المنافسة
ja: PKを終了します
zh_hans: 结束PK
zh_hant: 結束PK

# common_end_pk_tips
source: You are currently in PK mode. Would you like to [End PK] or [End Live] ?
ar: أنت حالياً في وضع المنافسة. هل تريد [إنهاء المنافسة] أم [إنهاء البث]؟
ja: 現在、PKステータスでは、「PKを終了」する必要がありますか、それとも「ライブブロードキャストルームを閉じる」必要がありますか？
zh_hans: 当前处于PK状态，是否需要「结束PK」或「关闭直播间」
zh_hant: 當前處於PK狀態，是否需要「結束PK」或「關閉直播間」

# common_kick_out_of_room
source: Remove
ar: إزالة
ja: 取り除く
zh_hans: 移除
zh_hant: 移除

# common_kicked_out_of_room_by_owner
source: You have been kicked out of the room
ar: تم طردك من الغرفة
ja: あなたは部屋から追い出されました
zh_hans: 您已被踢出房间
zh_hant: 您已被踢出房間

# common_more
source: More
ar: المزيد
ja: もっと
zh_hans: 更多
zh_hant: 更多

# common_more_features
source: More Features
ar: المزيد من الميزات
ja: その他の機能
zh_hans: 更多功能
zh_hant: 更多功能

# common_mute_audio
source: Mute
ar: كتم الصوت
ja: ミュート
zh_hans: 静音
zh_hant: 靜音

# common_mute_audio_by_master
source: The anchor has muted you
ar: قام المذيع بكتم صوتك
ja: あなたはアンカーによってミュートされました
zh_hans: 您已被主播静音
zh_hant: 您已被主播靜音

# common_mute_video_by_owner
source: The anchor disabled your video
ar: قام المذيع بتعطيل الفيديو الخاص بك
ja: あなたはアンカーによってオフにされました
zh_hans: 您已被主播关闭摄像头
zh_hant: 您已被主播關閉攝像頭

# common_muted_gift
source: You have been muted in the current room and cannot send gifts
ar: تم كتم صوتك في الغرفة الحالية ولا يمكنك إرسال الهدايا
ja: あなたは部屋で禁止されており、贈り物を送ることができません
zh_hans: 当前房间内您已被禁言，无法发送礼物
zh_hant: 當前房間內您已被禁言，無法發送禮物

# common_preview_video_live
source: Live Video
ar: فيديو مباشر
ja: ライブビデオ
zh_hans: 视频直播
zh_hant: 視頻直播

# common_recommended_list
source: Suggested Hosts
ar: المذيعون المقترحون
ja: 推奨リスト
zh_hans: 推荐列表
zh_hant: 推薦列表

# common_requesting
source: Requesting(xxx)
ar: جاري الطلب (xxx)
ja: 接続を申請する（xxx）
zh_hans: 申请连麦(xxx)
zh_hant: 申請連麥(xxx)

# common_roominfo_liveroom_id
source: Live Room ID: xxx
ar: معرف غرفة البث: xxx
ja: ライブルームID：xxx
zh_hans: 直播房间ID：xxx
zh_hant: 直播房間ID：xxx

# common_seat_application_title
source: Link Application(xxx)
ar: طلب الربط (xxx)
ja: 接続を申請する（xxx）
zh_hans: 申请连麦(xxx)
zh_hant: 申請連麥(xxx)

# common_seat_list_title
source: Current Mic (xxx)
ar: الميكروفون الحالي (xxx)
ja: 現在の位置（xxx）
zh_hans: 当前麦位 (xxx)
zh_hant: 當前麥位 (xxx)

# common_send_message_disabled
source: You have been muted in the current room
ar: تم كتم صوتك في الغرفة الحالية
ja: あなたは現在の部屋で禁止されています
zh_hans: 当前房间内，您已被禁言
zh_hant: 當前房間內，您已被禁言

# common_send_message_enable
source: You have been unmuted in the current room
ar: تم إلغاء كتم صوتك في الغرفة الحالية
ja: 現在の部屋で、あなたは禁止から持ち上げられました
zh_hans: 当前房间内，您已被解除禁言
zh_hant: 當前房間內，您已被解除禁言

# common_setting_done
source: Done
ar: تم
ja: 仕上げる
zh_hans: 完成
zh_hant: 完成

# common_start_connection
source: Invite
ar: دعوة
ja: 接続を開始します
zh_hans: 发起连线
zh_hant: 發起連線

# common_start_live
source: Start Live
ar: بدء البث
ja: ライブブロードキャストを開始します
zh_hans: 开始直播
zh_hant: 開始直播

# common_start_video
source: Start Video
ar: بدء الفيديو
ja: ビデオをオンにします
zh_hans: 开启视频
zh_hant: 開啟視頻

# common_stop_video
source: Stop Video
ar: إيقاف الفيديو
ja: ビデオを閉じます
zh_hans: 关闭视频
zh_hant: 關閉視頻

# common_terminate_room_connection_message
source: Are you sure you want to disconnect?
ar: هل أنت متأكد أنك تريد قطع الاتصال؟
ja: 切断したいですか？
zh_hans: 确定要断开连麦吗？
zh_hant: 確定要斷開連麥嗎？

# common_un_mute_audio_by_master
source: The anchor has unmuted you
ar: قام المذيع بإلغاء كتم صوتك
ja: アンカーはあなたを解きません
zh_hans: 主播解除了您的静音
zh_hant: 主播解除了您的靜音

# common_un_mute_video_by_master
source: The anchor enabled your video
ar: قام المذيع بتفعيل الفيديو الخاص بك
ja: アンカーはカメラのロックを解除しました
zh_hans: 主播解禁了你的摄像头
zh_hant: 主播解禁了你的攝像頭

# common_unmute_audio
source: Unmute
ar: إلغاء كتم الصوت
ja: ミュート
zh_hans: 解除静音
zh_hant: 解除靜音

# common_user_id
source: ID: xxx
ar: xxx:ID

# common_video_bitrate
source: Video Bitrate
ar: معدل بت الفيديو
ja: ビデオコードレート
zh_hans: 视频码率
zh_hant: 視頻碼率

# common_video_fps
source: Video FPS
ar: معدل إطارات الفيديو
ja: ビデオフレームレート
zh_hans: 视频帧率
zh_hant: 視頻幀率

# common_video_resolution
source: Video Resolution
ar: دقة الفيديو
ja: ビデオ解像度
zh_hans: 视频分辨率
zh_hant: 視頻解析度

# common_video_ultimate
source: Ultimate-Video
ar: فيديو فائق الجودة
ja: 究極の画質
zh_hans: 至臻画质
zh_hant: 至臻畫質

# common_link_guest
source: Guest
ar: ضيف
ja: 聴衆でさえ
zh_hans: 连观众
zh_hant: 連觀眾

# common_link_host
source: Host
ar: مضيف
ja: アンカーでさえ
zh_hans: 连主播
zh_hant: 連主播

source: Live Mode:xxx
ar: وضع البث: xxx
ja: ライブブロードキャストモード：xxx
zh_hans: 直播模式:xxx
zh_hant: 直播模式:xxx

# Live type:xxx
source: Live Category:xxx
ar: فئة البث: xxx
ja: ライブブロードキャストカテゴリ：xxx
zh_hans: 直播分类:xxx
zh_hant: 直播分類:xxx

# live_application_list_xxx
source: Application List (xxx)
ar: قائمة الطلبات (xxx)
ja: アプリケーションリスト（xxx）
zh_hans: 申请列表 (xxx)
zh_hant: 申請列表 (xxx)

# live_barrage_anchor
source: Anchor
ar: المذيع
ja: アンカー
zh_hans: 主播
zh_hant: 主播

# live_barrage_error_content_is_long
source: The content is too long, please reduce the content and try again
ar: المحتوى طويل جداً، يرجى تقليل المحتوى والمحاولة مرة أخرى
ja: コンテンツが長すぎるので、試す前にコンテンツを減らしてください
zh_hans: 内容太长，请缩减内容后再试
zh_hant: 內容太長，請縮減內容後再試

# live_barrage_error_network
source: The network is abnormal, please try again later
ar: الشبكة غير طبيعية، يرجى المحاولة لاحقاً
ja: ネットワークの異常、後でもう一度やり直してください
zh_hans: 网络异常，请稍后再试
zh_hant: 網絡異常，請稍後再試

# live_barrage_error_sensitive_word
source: Sensitive words are detected, please modify it and try again
ar: تم اكتشاف كلمات حساسة، يرجى التعديل والمحاولة مرة أخرى
ja: 敏感な単語が検出されました。それらを変更して、もう一度やり直してください
zh_hans: 检测到敏感词，请修改后重试
zh_hant: 檢測到敏感詞，請修改後重試

# live_barrage_text_hint
source: Join Chat!
ar: انضم للدردشة!
ja: 何か言って...
zh_hans: 说点什么…
zh_hant: 說點什麼…

# live_edit_placeholder_text
source: Please enter room name
ar: يرجى إدخال اسم الغرفة
ja: 部屋の名前を入力してください
zh_hans: 请输入房间名
zh_hant: 請輸入房間名

# live_error_connection_notexit
source: The room you are invited to connect to does not exist
ar: الغرفة المدعو للاتصال بها غير موجودة
ja: 招待状リンクが存在しない部屋
zh_hans: 邀请连线的房间不存在
zh_hant: 邀請連線的房間不存在

# live_error_connection_retry
source: Internal error, it is recommended to try again.
ar: خطأ داخلي، يُنصح بالمحاولة مرة أخرى.
ja: 内部エラー、再試行することをお勧めします。
zh_hans: 内部错误，推荐重试一次。
zh_hant: 內部錯誤，推薦重試一次。

# live_error_room_mismatch
source: The room types do not match; connections can only be initiated in rooms of the same type.
ar: أنواع الغرف غير متطابقة؛ يمكن بدء الاتصالات فقط في غرف من نفس النوع.
ja: 部屋のタイプが一致しません。接続は同じタイプの部屋でのみ開始できます。
zh_hans: 房间类型不匹配，只能在相同类型房间发起连线。
zh_hant: 房間類型不匹配，只能在相同類型房間發起連線。

# live_gift_animation_is_not_mp4_file
source: animation is not MP4 resource file
ar: الرسوم المتحركة ليست ملف MP4
ja: ギフトアニメーションはMP4リソースではありません
zh_hans: 礼物动画不是MP4资源
zh_hant: 禮物動畫不是MP4資源

# live_gift_animation_is_not_svga_file
source: animation is not svga resource file
ar: الرسوم المتحركة ليست ملف SVGA
ja: ギフトアニメーションはSVGAリソースではありません
zh_hans: 礼物动画不是SVGA资源
zh_hant: 禮物動畫不是SVGA資源

# live_landscape_title
source: Switch to Landscape
ar: التبديل إلى الوضع الأفقي
ja: 水平面画面に切り替えます
zh_hans: 切换至横屏
zh_hant: 切換至橫屏

# live_music_play_error
source: Music play error
ar: خطأ في تشغيل الموسيقى
ja: 音楽の再生は失敗しました
zh_hans: 音乐播放失败
zh_hant: 音樂播放失敗

# live_on_seat_list
source: Connected (xxx)
ar: متصل (xxx)
ja: 接続済み（xxx）
zh_hans: 已连线（xxx）
zh_hant: 已連線（xxx）

# live_portrait_title
source: Switch to Portrait
ar: التبديل إلى الوضع العمودي
ja: 垂直画面に切り替えます
zh_hans: 切换至竖屏
zh_hant: 切換至豎屏

# live_room_list_loading_more
source: Loading more
ar: جاري تحميل المزيد
ja: もっとロードします
zh_hans: 加载更多
zh_hant: 加載更多

# live_room_list_pull_to_refresh
source: Pull to refresh
ar: اسحب للتحديث
ja: プルダウンして更新します
zh_hans: 下拉刷新
zh_hant: 下拉刷新

# live_room_list_release_to_refresh
source: Release to refresh
ar: أفلت للتحديث
ja: 更新をリリースします
zh_hans: 松开刷新
zh_hant: 鬆開刷新

# live_waiting_link
source: Waiting for link xxx
ar: في انتظار الربط xxx
ja: ツイートxxxを待っています
zh_hans: 等待连麦 xxx
zh_hant: 等待連麥 xxx

# livelist_loading
source: Loading...
ar: جاري التحميل...
ja: 読み込み...
zh_hans: 正在加载...
zh_hant: 正在加載...

# livelist_no_more_data
source: There is no more data
ar: لا توجد بيانات إضافية
ja: これ以上のデータはありません
zh_hans: 没有更多数据了
zh_hant: 沒有更多數據了

# livelist_viewed_audience_count
source: xxx people viewed
ar: شاهده xxx شخص
ja: xxx人々はそれを見ました
zh_hans: xxx人看过
zh_hant: xxx人看過

# livelist_exit_float_window_tip
source: Live streaming in progress. Please try again later.
ar: البث المباشر قيد التقدم. يرجى المحاولة مرة أخرى لاحقاً.
ja: 現在放送されています。後でもう一度やり直してください。
zh_hans: 正在直播中，请稍后再试。
zh_hant: 正在直播中，請稍後再試。

# livelist_click_enter_room
source: Click to enter the live room
ar: انقر لدخول غرفة البث
ja: クリックしてライブブロードキャストルームに入ります
zh_hans: 点击进入直播间
zh_hant: 點擊進入直播間

# livestreamcore_battle_error_conflict
source: The anchor is in the battle and cannot initiate the battle
ar: المذيع في منافسة ولا يمكنه بدء منافسة أخرى
ja: アンカーはPKにあり、PKを開始できません
zh_hans: 主播正在PK中，无法发起PK
zh_hant: 主播正在PK中，無法發起PK

# livestreamcore_battle_error_other
source: The other error, cannot initiate the battle
ar: خطأ آخر، لا يمكن بدء المنافسة
ja: PKを開始できない他のエラー
zh_hans: 其他错误，无法发起PK
zh_hant: 其他錯誤，無法發起PK

# te_beauty_capabilities_panel_view_switch_turn_off
source: turn off
ar: إيقاف
ja: 閉鎖
zh_hans: 关闭
zh_hant: 關閉

# te_beauty_panel_menu_view_layout_lut
source: Filters
ar: الفلاتر
ja: フィルター
zh_hans: 滤镜
zh_hant: 濾鏡

# te_beauty_panel_menu_view_layout_makeup
source: Makeup
ar: المكياج
ja: 美容メイク
zh_hans: 美妆
zh_hant: 美妝

source: Waiting for battlexxx
ar: في انتظار المنافسة xxx
ja: 同意を待っていますpkxxx
zh_hans: 等待同意PKxxx
zh_hant: 等待同意PKxxx

source: Waitingxxx
ar: في الانتظار xxx
ja: xxxを通過するのを待っています
zh_hans: 待通过xxx
zh_hant: 待通過xxx

source: xxx Fans
ar: xxx متابع
ja: xxxファン
zh_hans: xxx 粉丝
zh_hant: xxx 粉絲

# common_audience_end_link_tips
source: You are currently co-guesting with other streamers. Would you like to [End Co-guest] or [Exit Live] ?
ar: أنت حالياً في بث مشترك. هل تريد [إنهاء البث المشترك] أم [الخروج من البث]؟
ja: 現在、接続されているマイク状態で、「接続されたマイクを切断する」または「ライブブロードキャストルームを終了する」必要がありますか？
zh_hans: 当前处于连麦状态，是否需要「断开连麦」或「退出直播间」
zh_hant: 當前處於連麥狀態，是否需要「斷開連麥」或「退出直播間」

# common_exit_live
source: Exit Live
ar: الخروج من البث
ja: ライブブロードキャストルームを出ます
zh_hans: 退出直播间
zh_hant: 退出直播間

# common_gift_me
source: Me
ar: أنا
ja: 私
zh_hans: 我
zh_hant: 我

# common_voiceroom_kicked_out_of_seat
source: Kicked out of seat by room owner
ar: تم طردك من المقعد بواسطة صاحب الغرفة
ja: ホストによってマイクをキックオフしました
zh_hans: 被主持人踢下麦位
zh_hant: 被主持人踢下麥位

# common_apply_link_mic
source: Apply for link mic
ar: التقدم لربط الميكروفون
ja: ツイートを申請してください
zh_hans: 申请连麦
zh_hant: 申請連麥

# common_client_error_already_in_other_room
source: User is Already in Another Room, Single RoomEngine Instance Only Supports User Entering One Room, To Enter Different Room, Please Leave the Room or Use New RoomEngine Instance
ar: المستخدم موجود بالفعل في غرفة أخرى
ja: 現在のユーザーは別の部屋にいます。単一のルームエンジンインスタンスは、ユーザーのみが1つの部屋に入るのをサポートします。別の部屋に入りたい場合は、最初にチェックアウトするか、新しいルームエンジンインスタンスを使用してください。
zh_hans: 当前用户已在别的房间内，单个 roomEngine 实例只支持用户进入一个房间，如果要进入不同的房间请先退房或者使用新的 roomEngine 实例
zh_hant: 當前用戶已在別的房間內，單個 roomEngine 實例只支持用戶進入一個房間，如果要進入不同的房間請先退房或者使用新的 roomEngine 實例

# common_client_error_camera_device_empty
source: No Camera Device Currently, Please Insert Camera Device to Solve the Problem
ar: لا يوجد جهاز كاميرا حالياً، يرجى إدخال جهاز كاميرا
ja: 現在、カメラデバイスはありません。カメラデバイスを挿入して問題を解決してください
zh_hans: 当前无摄像头设备，请插入摄像头设备解决该问题
zh_hant: 當前無攝像頭設備，請插入攝像頭設備解決該問題

# common_client_error_camera_not_authorized
source: Camera has No System Authorization, Check System Authorization
ar: الكاميرا ليس لديها إذن النظام، تحقق من إذن النظام
ja: カメラにはシステム承認がありません。システム認証を確認してください
zh_hans: 摄像头没有系统授权, 检查系统授权
zh_hant: 攝像頭沒有系統授權, 檢查系統授權

# common_client_error_camera_occupied
source: Camera is Occupied, Check if Other Process is Using Camera
ar: الكاميرا مشغولة، تحقق مما إذا كانت عملية أخرى تستخدم الكاميرا
ja: カメラが占有されています。カメラを使用して他のプロセスがあるかどうかを確認してください
zh_hans: 摄像头被占用，检查是否有其他进程使用摄像头
zh_hant: 攝像頭被佔用，檢查是否有其他進程使用攝像頭

# common_client_error_camera_start_fail
source: System Issue, Failed to Open Camera. Check if Camera Device is Normal
ar: مشكلة في النظام، فشل فتح الكاميرا. تحقق مما إذا كان جهاز الكاميرا طبيعياً
ja: システムの問題は、カメラをオンにすることができませんでした。カメラデバイスが正常かどうかを確認してください
zh_hans: 系统问题，打开摄像头失败。检查摄像头设备是否正常
zh_hant: 系統問題，打開攝像頭失敗。檢查攝像頭設備是否正常

# common_client_error_connection_connecting
source: The room you are invited to connect to is already in the invitation list or is already connected.
ar: الغرفة المدعو للاتصال بها موجودة بالفعل في قائمة الدعوات أو متصلة بالفعل.
ja: 接続するために招待されている部屋は、すでに招待リストに載っているか、接続されています。
zh_hans: 被邀请连线的房间已在邀请列表或者已连线。
zh_hant: 被邀請連線的房間已在邀請列表或者已連線。

# common_client_error_exit_not_supported_for_room_owner
source: Room Owner Does Not Support Leaving the Room, Room Owner Can Only Close the Room
ar: صاحب الغرفة لا يدعم مغادرة الغرفة، يمكنه فقط إغلاق الغرفة
ja: 住宅所有者はチェックアウト操作をサポートしていません、住宅所有者は部屋を解散することしかできません
zh_hans: 房主不支持退房操作，房主只能解散房间
zh_hant: 房主不支持退房操作，房主只能解散房間

# common_client_error_failed
source: Server is having a hiccup, please try again later
ar: الخادم يواجه مشكلة مؤقتة، يرجى المحاولة لاحقاً
ja: サーバーが一時的に不調です。しばらくしてから再試行してください
zh_hans: 服务器开小差啦，请稍后重试
zh_hant: 伺服器開小差啦，請稍後重試

# common_client_error_freq_limit
source: Request Rate Limited, Please Try Again Later
ar: تم تحديد معدل الطلبات، يرجى المحاولة لاحقاً
ja: リクエストは制限されています。後でもう一度やり直してください
zh_hans: 请求被限频，请稍后重试
zh_hant: 請求被限頻，請稍後重試

# common_client_error_get_screen_sharing_target_failed
source: Failed to get screen sharing source (screen and window), check screen recording permissions
ar: فشل الحصول على مصدر مشاركة الشاشة، تحقق من أذونات تسجيل الشاشة
ja: 画面共有ソース（画面とウィンドウ）を取得し、画面録音の許可を確認できませんでした
zh_hans: 获取屏幕分享源（屏幕和窗口）失败，检查屏幕录制权限
zh_hant: 獲取屏幕分享源（屏幕和窗口）失敗，檢查屏幕錄製權限

# common_client_error_invalid_parameter
source: Passing illegal parameters when calling API, check if the parameters are legal
ar: تمرير معلمات غير قانونية عند استدعاء API، تحقق من صحة المعلمات
ja: APIを呼び出すと、合格したパラメーターは違法です。パラメーターが合法かどうかを確認してください。
zh_hans: 调用 API 时，传入的参数不合法，检查入参是否合法
zh_hant: 調用 API 時，傳入的參數不合法，檢查入參是否合法

# common_client_error_max_seat_count_limit
source: Maximum Seat Exceeds Package Quantity Limit
ar: الحد الأقصى للمقاعد يتجاوز حد الباقة
ja: クロワッサンの最大位置は、パッケージパッケージの数の制限を超えています
zh_hans: 最大麦位超出套餐包数量限制
zh_hant: 最大麥位超出套餐包數量限制

# common_client_error_microphone_device_empty
source: No Mic Device Currently
ar: لا يوجد جهاز ميكروفون حالياً
ja: 現在、マイクデバイスはありません
zh_hans: 当前无麦克风设备
zh_hant: 當前無麥克風設備

# common_client_error_microphone_not_authorized
source: Mic has No System Authorization, Check System Authorization
ar: الميكروفون ليس لديه إذن النظام
ja: マイクにはシステム認証がありません。システム認証を確認してください
zh_hans: 麦克风没有系统授权，检查系统授权
zh_hant: 麥克風沒有系統授權，檢查系統授權

# common_client_error_microphone_occupied
source: Mic is Occupied
ar: الميكروفون مشغول
ja: マイクが占有されました
zh_hans: 麦克风被占用
zh_hant: 麥克風被佔用

# common_client_error_microphone_start_fail
source: System Issue, Failed to Open Mic. Check if Mic Device is Normal
ar: مشكلة في النظام، فشل فتح الميكروفون
ja: システムの問題は、マイクをオンにすることができませんでした。マイクデバイスが正常かどうかを確認してください
zh_hans: 系统问题，打开麦克风失败。检查麦克风设备是否正常
zh_hant: 系統問題，打開麥克風失敗。檢查麥克風設備是否正常

# common_client_error_open_camera_need_permission_from_admin
source: Need to Apply to Room Owner or Administrator to Open Camera
ar: يجب التقدم لصاحب الغرفة أو المسؤول لفتح الكاميرا
ja: 住宅所有者または管理者に申請してカメラをオンにする必要があります
zh_hans: 需要向房主或管理员申请后打开摄像头
zh_hant: 需要向房主或管理員申請後打開攝像頭

# common_client_error_open_camera_need_seat_unlock
source: Current Seat Video is Locked, Need Room Owner to Unlock Mic Seat Before Opening Camera
ar: فيديو المقعد الحالي مقفل، يحتاج صاحب الغرفة لفتح قفل المقعد
ja: 現在のマイクのビデオはロックされており、住宅所有者はカメラをオンにする前にマイクのロックを解除する必要があります。
zh_hans: 当前麦位视频被锁, 需要由房主解锁麦位后，才能打开摄像头
zh_hant: 當前麥位視頻被鎖, 需要由房主解鎖麥位後，才能打開攝像頭

# common_client_error_open_microphone_need_permission_from_admin
source: Need to Apply to Room Owner or Administrator to Open Mic
ar: يجب التقدم لصاحب الغرفة أو المسؤول لفتح الميكروفون
ja: 住宅所有者または管理者に申請し、マイクをオンにする必要があります
zh_hans: 需要向房主或管理员申请后打开麦克风
zh_hant: 需要向房主或管理員申請後打開麥克風

# common_client_error_open_microphone_need_seat_unlock
source: Current Seat Audio is Locked
ar: صوت المقعد الحالي مقفل
ja: 現在のマイクオーディオがロックされています
zh_hans: 当前麦位音频被锁
zh_hant: 當前麥位音頻被鎖

# common_client_error_open_screen_share_need_permission_from_admin
source: Screen sharing needs to be enabled after applying to the room owner or administrator
ar: يجب تفعيل مشاركة الشاشة بعد التقدم لصاحب الغرفة
ja: 住宅所有者または管理者に申請し、画面を開いて共有する必要があります
zh_hans: 需要向房主或管理员申请后打开屏幕分享
zh_hant: 需要向房主或管理員申請後打開屏幕分享

# common_client_error_open_screen_share_need_seat_unlock
source: The current microphone position video is locked and needs to be unlocked by the room owner before screen sharing can be enabled
ar: فيديو موضع الميكروفون الحالي مقفل ويحتاج لفتح القفل من صاحب الغرفة
ja: 現在のマイクビデオがロックされています。住宅所有者は、画面を開いて共有する前にマイクのロックを解除する必要があります。
zh_hans: 当前麦位视频被锁, 需要由房主解锁麦位后，才能打开屏幕分享
zh_hant: 當前麥位視頻被鎖, 需要由房主解鎖麥位後，才能打開屏幕分享

# common_client_error_operation_invalid_before_enter_room
source: This Feature Can Only Be Used After Entering the Room
ar: يمكن استخدام هذه الميزة فقط بعد دخول الغرفة
ja: この機能を使用する前に部屋に入る必要があります
zh_hans: 需要进房后才可使用此功能
zh_hant: 需要進房後才可使用此功能
